# Taps
tap 'stripe/stripe-cli'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
brew 'stripe/stripe-mock/stripe-mock'
brew 'svn' # Needed to install fonts

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'imagemagick'
brew 'yarn'

# Apps
cask '1password'
cask 'discord'
cask 'docker'
cask 'docker-desktop'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'herd'
cask 'imageoptim'
cask 'slack'
cask 'tableplus'
cask 'transmit'
cask 'visual-studio-code'
cask 'zoom'
cask 'rectangle'
cask 'vanilla'
cask 'rocket'

# Quicklook
cask 'qlmarkdown'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-3'
cask 'font-source-serif-4'
cask 'font-cascadia-code'
cask 'font-ibm-plex-mono'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
