# Taps
tap 'stripe/stripe-cli'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'eza'
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'grep'
brew 'httpie'
brew 'jq'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config'
brew 'stripe/stripe-cli/stripe'
brew 'stripe/stripe-mock/stripe-mock'
brew 'gifsicle'
brew 'imagemagick'
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'trash'
brew 'zsh-autosuggestions'

# Development Apps
cask 'claude'
cask 'claude-code'
cask 'codex'
cask 'dbngin'
cask 'ghostty'
cask 'github'
cask 'herd'
cask 'imageoptim'
cask 'orbstack'
cask 'ray'
cask 'tableplus'
cask 'tower'
cask 'tuple'
cask 'visual-studio-code'

# Browsers
cask 'firefox'
cask 'google-chrome'

# Productivity
cask '1password'
cask 'figma'
cask 'obsidian'
cask 'raycast'
cask 'rectangle'
cask 'rocket'
cask 'transmit'
cask 'vanilla'

# Communication
cask 'discord'
cask 'slack'
cask 'zoom'

# QuickLook plugins
cask 'betterzip'
cask 'suspicious-package'

# Fonts
cask 'font-cascadia-code'
cask 'font-ibm-plex-mono'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-sans-3'
cask 'font-source-serif-4'